package com.utils;

/**
 * Created by dengwenzhong on 17/7/8.
 */
public interface RestCode {
    String CD3[] = {"3", "温馨提示:"};
    String CD2[] = {"2", "参数错误:"};
    String CD1[] = {"1", "成功"};
    String CD0[] = {"0", "失败"};



    String CD1001[] = {"1001", "dataSource没有初始化"};



    String CD101[] = {"101", "用户名不存在"};
    String CD102[] = {"102", "用户名状态异常"};
    String CD103[] = {"103", "用户名不存在或者密码错误"};
    String CD104[] = {"104", "access_token 不能为空"};
    String CD105[] = {"105", "access_token 无效"};
    String CD106[] = {"106", "用户名不能为空"};
    String CD107[] = {"107", "您没有登录权限"};
    String CD108[] = {"108", "domain 不能为空"};
    String CD109[] = {"109", "用户会话已过期"};
    String CD110[] = {"110", "账户被禁用，请联系管理员"};
    String CD111[] = {"111", "您没有权限"};
    String CD112[] = {"112", "您的帐户可用余额不够，请充值"};
    String CD113[] = {"113", "您的帐户冻结金额异常，请联系客服"};
    String CD114[] = {"114", "扣帐户金额出现异常，请联系客服"};
    String CD115[] = {"115", "平台来源为空"};
    String CD116[] = {"116", "渠道号为空"};
    String CD117[] = {"117", "创建订单异常"};
    String CD118[] = {"118", "订单金额错误"};
    String CD119[] = {"119", "订单中奖金额异常"};
    String CD120[] = {"120", "更新帐户金额失败"};
    String CD121[] = {"121", "更新订单状态失败"};
    String CD122[] = {"122", "短信服务暂时停止,请稍后再试"};
    String CD123[] = {"123", "短信服务操作过于频繁,请稍后再试"};
    String CD124[] = {"124", "昵称已存在"};
    String CD125[] = {"125", "已修改过昵称"};
    String CD126[] = {"126", "密码不符合规则"};
    String CD127[] = {"127", "验证码错误"};
    String CD128[] = {"128", "提现金额小于10元"};

    String CD129[] = {"129", "用户未身份认证"};
    String CD130[] = {"130", "用户未绑定银行信息"};
    String CD131[] = {"131", "银行卡信息不匹配"};
    String CD132[] = {"132", "提取金额超过可提金额"};
    String CD133[] = {"133", "支付订单状态更新失败"};
    String CD134[] = {"134", "冻结帐户金额失败,请重新提交"};
    String CD135[] = {"135", "不符合更改银行信息条件"};
}
